Table of Contents
 Class CadUserSelection
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
public class CadUserSelection
Inheritance
object
CadUserSelection
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 ConnectionPoint
public Identifier<IIdeaConnectionPoint> ConnectionPoint { get; set; }
Property Value
Identifier<IIdeaConnectionPoint>
 Members
public ICollection<Identifier<IIdeaConnectedMember>> Members { get; set; }
Property Value
ICollection<Identifier<IIdeaConnectedMember>>
 Objects
public ICollection<IIdentifier> Objects { get; set; }
Property Value
ICollection<IIdentifier>
 Edit this page